
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 17 to add, 0 to change, 12 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.fixed_secrets[&#34;bureau-jwtTTL&#34;]
  * azurerm_key_vault_secret.fixed_secrets[&#34;public-jwtTTL&#34;]
  * azurerm_key_vault_secret.stored[&#34;bureau-jwtKey&#34;]
  * azurerm_key_vault_secret.stored[&#34;bureau-sessionSecret&#34;]
  * azurerm_key_vault_secret.stored[&#34;jwtNoAuthKey&#34;]
  * azurerm_key_vault_secret.stored[&#34;public-jwtKey&#34;]
  * azurerm_key_vault_secret.stored[&#34;public-sessionSecret&#34;]
  * azurerm_key_vault_secret.stored2[&#34;bureau-jwtKey&#34;]
  * azurerm_key_vault_secret.stored2[&#34;jwtNoAuthKey&#34;]
  * azurerm_key_vault_secret.stored64[&#34;bureau-jwtKey&#34;]
  * azurerm_key_vault_secret.stored64[&#34;jwtNoAuthKey&#34;]
  * azurerm_key_vault_secret.stored64[&#34;public-jwtKey&#34;]
  * random_password.generated[&#34;bureau-jwtKey&#34;]
  * random_password.generated[&#34;bureau-sessionSecret&#34;]
  * random_password.generated[&#34;jwtNoAuthKey&#34;]
  * random_password.generated[&#34;public-jwtKey&#34;]
  * random_password.generated[&#34;public-sessionSecret&#34;]
* Delete
  * azurerm_key_vault_secret.stored[&#34;Ian-Test-all&#34;]
  * azurerm_key_vault_secret.stored[&#34;Ian-Test-normal-both&#34;]
  * azurerm_key_vault_secret.stored[&#34;Ian-Test-normal-only&#34;]
  * azurerm_key_vault_secret.stored2[&#34;Ian-Test-all&#34;]
  * azurerm_key_vault_secret.stored2[&#34;Ian-Test-normal-both&#34;]
  * azurerm_key_vault_secret.stored64[&#34;Ian-Test-64-only&#34;]
  * azurerm_key_vault_secret.stored64[&#34;Ian-Test-all&#34;]
  * random_password.generated[&#34;Ian-Test-64-only&#34;]
  * random_password.generated[&#34;Ian-Test-all&#34;]
  * random_password.generated[&#34;Ian-Test-none&#34;]
  * random_password.generated[&#34;Ian-Test-normal-both&#34;]
  * random_password.generated[&#34;Ian-Test-normal-only&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.fixed_secrets["bureau-jwtTTL"] will be created
  + resource "azurerm_key_vault_secret" "fixed_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "bureau-jwtTTL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.fixed_secrets["public-jwtTTL"] will be created
  + resource "azurerm_key_vault_secret" "fixed_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "public-jwtTTL"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored["Ian-Test-all"] will be destroyed
  # (because key ["Ian-Test-all"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "stored" {
      - id                      = "https://juror-stg.vault.azure.net/secrets/Ian-Test-all/027b66a409b0418b874ced6b60aa7974" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg" -> null
      - name                    = "Ian-Test-all" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-all/versions/027b66a409b0418b874ced6b60aa7974" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-all" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "027b66a409b0418b874ced6b60aa7974" -> null
      - versionless_id          = "https://juror-stg.vault.azure.net/secrets/Ian-Test-all" -> null
    }

  # azurerm_key_vault_secret.stored["Ian-Test-normal-both"] will be destroyed
  # (because key ["Ian-Test-normal-both"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "stored" {
      - id                      = "https://juror-stg.vault.azure.net/secrets/Ian-Test-normal-both/1f57e7b2034b4ce2b474bdc94b0ccdb9" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg" -> null
      - name                    = "Ian-Test-normal-both" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-normal-both/versions/1f57e7b2034b4ce2b474bdc94b0ccdb9" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-normal-both" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "1f57e7b2034b4ce2b474bdc94b0ccdb9" -> null
      - versionless_id          = "https://juror-stg.vault.azure.net/secrets/Ian-Test-normal-both" -> null
    }

  # azurerm_key_vault_secret.stored["Ian-Test-normal-only"] will be destroyed
  # (because key ["Ian-Test-normal-only"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "stored" {
      - id                      = "https://juror-stg.vault.azure.net/secrets/Ian-Test-normal-only/f4f27adea69f447080a4a9d0a632dbc6" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg" -> null
      - name                    = "Ian-Test-normal-only" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-normal-only/versions/f4f27adea69f447080a4a9d0a632dbc6" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-normal-only" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "f4f27adea69f447080a4a9d0a632dbc6" -> null
      - versionless_id          = "https://juror-stg.vault.azure.net/secrets/Ian-Test-normal-only" -> null
    }

  # azurerm_key_vault_secret.stored["bureau-jwtKey"] will be created
  + resource "azurerm_key_vault_secret" "stored" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "bureau-jwtKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored["bureau-sessionSecret"] will be created
  + resource "azurerm_key_vault_secret" "stored" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "bureau-sessionSecret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored["jwtNoAuthKey"] will be created
  + resource "azurerm_key_vault_secret" "stored" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "bureau-jwtNoAuthKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored["public-jwtKey"] will be created
  + resource "azurerm_key_vault_secret" "stored" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "public-jwtKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored["public-sessionSecret"] will be created
  + resource "azurerm_key_vault_secret" "stored" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "public-sessionSecret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored2["Ian-Test-all"] will be destroyed
  # (because key ["Ian-Test-all"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "stored2" {
      - id                      = "https://juror-stg.vault.azure.net/secrets/Ian-Test-all-Second/13d7453df3e348049e9cb3cc1b4819de" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg" -> null
      - name                    = "Ian-Test-all-Second" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-all-Second/versions/13d7453df3e348049e9cb3cc1b4819de" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-all-Second" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "13d7453df3e348049e9cb3cc1b4819de" -> null
      - versionless_id          = "https://juror-stg.vault.azure.net/secrets/Ian-Test-all-Second" -> null
    }

  # azurerm_key_vault_secret.stored2["Ian-Test-normal-both"] will be destroyed
  # (because key ["Ian-Test-normal-both"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "stored2" {
      - id                      = "https://juror-stg.vault.azure.net/secrets/Ian-Test-normal-both-Second/30f07df391f7475f8682eb2a4c88006e" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg" -> null
      - name                    = "Ian-Test-normal-both-Second" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-normal-both-Second/versions/30f07df391f7475f8682eb2a4c88006e" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-normal-both-Second" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "30f07df391f7475f8682eb2a4c88006e" -> null
      - versionless_id          = "https://juror-stg.vault.azure.net/secrets/Ian-Test-normal-both-Second" -> null
    }

  # azurerm_key_vault_secret.stored2["bureau-jwtKey"] will be created
  + resource "azurerm_key_vault_secret" "stored2" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "public-jwtKeyBureau"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored2["jwtNoAuthKey"] will be created
  + resource "azurerm_key_vault_secret" "stored2" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "public-jwtNoAuthKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored64["Ian-Test-64-only"] will be destroyed
  # (because key ["Ian-Test-64-only"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "stored64" {
      - id                      = "https://juror-stg.vault.azure.net/secrets/Ian-Test-64-only/5fe24d23fe374a5fa8d1d18442751b08" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg" -> null
      - name                    = "Ian-Test-64-only" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-64-only/versions/5fe24d23fe374a5fa8d1d18442751b08" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-64-only" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "5fe24d23fe374a5fa8d1d18442751b08" -> null
      - versionless_id          = "https://juror-stg.vault.azure.net/secrets/Ian-Test-64-only" -> null
    }

  # azurerm_key_vault_secret.stored64["Ian-Test-all"] will be destroyed
  # (because key ["Ian-Test-all"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "stored64" {
      - id                      = "https://juror-stg.vault.azure.net/secrets/Ian-Test-all-64/857d49a94d8c4695a35a0f4518ef10fc" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg" -> null
      - name                    = "Ian-Test-all-64" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-all-64/versions/857d49a94d8c4695a35a0f4518ef10fc" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg/secrets/Ian-Test-all-64" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "857d49a94d8c4695a35a0f4518ef10fc" -> null
      - versionless_id          = "https://juror-stg.vault.azure.net/secrets/Ian-Test-all-64" -> null
    }

  # azurerm_key_vault_secret.stored64["bureau-jwtKey"] will be created
  + resource "azurerm_key_vault_secret" "stored64" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "api-JWT-SECRET-BUREAU"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored64["jwtNoAuthKey"] will be created
  + resource "azurerm_key_vault_secret" "stored64" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "api-JWT-SECRET-HMAC"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored64["public-jwtKey"] will be created
  + resource "azurerm_key_vault_secret" "stored64" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "api-JWT-SECRET-PUBLIC"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # random_password.generated["Ian-Test-64-only"] will be destroyed
  # (because key ["Ian-Test-64-only"] is not in for_each map)
  - resource "random_password" "generated" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 32 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # random_password.generated["Ian-Test-all"] will be destroyed
  # (because key ["Ian-Test-all"] is not in for_each map)
  - resource "random_password" "generated" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 32 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # random_password.generated["Ian-Test-none"] will be destroyed
  # (because key ["Ian-Test-none"] is not in for_each map)
  - resource "random_password" "generated" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 32 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # random_password.generated["Ian-Test-normal-both"] will be destroyed
  # (because key ["Ian-Test-normal-both"] is not in for_each map)
  - resource "random_password" "generated" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 32 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # random_password.generated["Ian-Test-normal-only"] will be destroyed
  # (because key ["Ian-Test-normal-only"] is not in for_each map)
  - resource "random_password" "generated" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 32 -> null
      - lower       = true -> null
      - min_lower   = 3 -> null
      - min_numeric = 3 -> null
      - min_special = 0 -> null
      - min_upper   = 3 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # random_password.generated["bureau-jwtKey"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.generated["bureau-sessionSecret"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.generated["jwtNoAuthKey"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.generated["public-jwtKey"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.generated["public-sessionSecret"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 17 to add, 0 to change, 12 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":23,"Program":"tfcmt","SHA1":"","Vars":{}} -->